app/Http/Controllers/CoffeeConsumptionController.php

select * from `employees` where `employees`.`deleted_at` is null order by `last_name` asc, `first_name` asc
---
    public function showEmployee()
    {
        $employees = Employee::orderBy('last_name', 'asc')->orderBy('first_name', 'asc')->get();

insert into `coffee_consumptions` (`employee_id`, `year_of_order`, `month_of_order`, `day_of_order`, `updated_at`, `created_at`) values ('11', '2024', '01', '25', '2024-01-25 12:22:16', '2024-01-25 12:22:16')
---
    public function registerCoffee(Request $request)
    {
        $rules =
        [
            'employee_id' => 'required|exists:employees,id',
        ];

      $validated = $request->validate($rules);

      try {
          $d = CoffeeConsumption::create([
              'employee_id'              => $request['employee_id'],
              'year_of_order'            => now()->format('Y'),
              'month_of_order'            => now()->format('m'),
              'day_of_order'            => now()->format('d'),
          ]);

select * from `coffee_consumptions` where `year_of_order` in ('2023') and `month_of_order` in ('01') and `employee_id` in ('223') order by `year_of_order` asc, `month_of_order` asc, `day_of_order` asc, `employee_id` asc
select * from `employees` where `employees`.`id` in (20) and `employees`.`deleted_at` is null
select * from `employees` where `employees`.`id` in ('') and `employees`.`deleted_at` is null
select distinct `year_of_order` from `coffee_consumptions` order by `year_of_order` asc
select distinct `month_of_order` from `coffee_consumptions` order by `month_of_order` asc
select * from `employees` where `employees`.`id` in (2, 3, 6, 7, 8, 10, 11, 12, 14, 15, 16, 17, 20, 22, 23, 25, 26, 27, 28, 29, 30, 32, 33, 36, 41, 42, 43, 44, 45, 46, 47, 49, 53, 54, 56, 58, 59, 60, 62, 63, 64, 65, 66, 67, 68, 70, 71, 72, 74, 75, 76, 77, 78, 79, 81, 83, 84, 87, 89, 91, 93, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 108, 112, 115, 116, 117, 120, 121, 122, 123, 124, 125, 126, 127, 131, 132, 135, 136, 138, 141, 142, 146, 148, 149, 150, 152, 154, 156, 157, 158, 159, 160, 161, 162, 164, 166, 167, 168, 169, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 184, 185, 187, 189, 190, 192, 193, 195, 197, 198, 200, 203, 206, 209, 212, 213, 214, 217, 219, 220, 221, 222, 223, 224, 228, 230, 232, 233, 236, 237, 239, 240, 241, 243, 245, 247, 248, 249, 250) and `employees`.`deleted_at` is null
select distinct `employee_id` from `coffee_consumptions` order by `employee_id` asc
---
    public function searchCoffee(Request $request)
{
    $selectedYears = $request->input('year_of_order');
    $selectedMonths = $request->input('month_of_order');
    $selecteddays = $request->input('day_of_order');
    $selectedEmployees = $request->input('employee_id');

    $query = CoffeeConsumption::with('employee');

    if ($selectedYears) {
        $query->whereIn('year_of_order', $selectedYears);
    }

    if ($selectedMonths) {
        $query->whereIn('month_of_order', $selectedMonths);
    }

    if ($selecteddays) {
        $query->whereIn('day_of_order', $selecteddays);
    }

    if ($selectedEmployees) {
        $query->whereIn('employee_id', $selectedEmployees);
    }

    $results = $query->orderBy('year_of_order', 'asc')
                    ->orderBy('month_of_order', 'asc')
                    ->orderBy('day_of_order', 'asc')
                    ->orderBy('employee_id', 'asc')
                    ->get();

    $year = CoffeeConsumption::select('year_of_order')->with('employee')->orderby('year_of_order', 'asc')->distinct()->get();
    $month = CoffeeConsumption::select('month_of_order')->with('employee')->orderby('month_of_order', 'asc')->distinct()->get();
    $employee_id = CoffeeConsumption::select('employee_id')->with('employee')->orderby('employee_id', 'asc')->distinct()->get();