app/Http/Controllers/DepartmentController.php

select * from `departments` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `departments`
---
    public function index()
    {
        $departments = Department::withTrashed()->orderBy('id', 'asc')->paginate(10);

select * from `departments` where `departments`.`id` = 4120 and `departments`.`deleted_at` is null limit 1
---
    public function edit(Department $department)
    {
        $create = false;

        return view('admin.departments.upsert')->with('department', Department::find($department->id))->with('create', $create);

update `departments` set `deleted_at` = '2024-01-25 17:14:58', `departments`.`updated_at` = '2024-01-25 17:14:58' where `id` = 4110
---
    public function destroy(Department $department)
    {
        try {
            $department->delete();

select * from `departments` where `departments`.`id` = '4110' limit 1
---
    public function forceDestroy($id)
    {
        try {
            Department::withTrashed()->find($id)->forceDelete();

select * from `departments` where `departments`.`id` = '4110' limit 1
update `departments` set `deleted_at` = '', `departments`.`updated_at` = '2024-01-25 18:46:16' where `id` = 4110
---
    public function restore($id)
    {
        try {
            Department::withTrashed()->find($id)->restore();