app/Http/Controllers/EmployeeController.php

select * from `departments` where `departments`.`id` in (4130, 4140, 4160, 4190, 4260, 4330, 4340, 4630) and `departments`.`deleted_at` is null
select * from `employees` order by `last_name` asc, `first_name` asc limit 10 offset 0
select count(*) as aggregate from `employees`
---
    public function index()
    {
        $employees = Employee::withTrashed()->with('department')->orderBy('last_name', 'asc')->orderBy('first_name', 'asc')->paginate(10);