app/Http/Controllers/PaymentController.php

select * from `employees` where `employees`.`id` in (20, 39, 56, 71, 80, 195, 200, 222, 237, 242) and `employees`.`deleted_at` is null
select * from `payments` order by `date_of_income` desc limit 10 offset 0
select count(*) as aggregate from `payments`
---
    public function index()
    {
        $payments = Payment::withTrashed()->with('employee')->orderBy('date_of_income', 'desc')->paginate(10);